ERP.belugaerp/src/DataProcessors/бг_СчетБордеро/бг_СчетБордеро.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>бг_СчетБордеро</name>
</mdclass:DataProcessor>

ERP.belugaerp/src/AccumulationRegisters/РасчетыСПоставщиками/РасчетыСПоставщиками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РасчетыСПоставщиками</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources>
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Оплачивается</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes>
    <name>ЗаявкаНаРасходованиеДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаРегл</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>ОбъектРасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>АналитикаУчетаПоПартнерам</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

ERP.belugaerp/src/Enums/бг_ВидыМаршрутныхЛистов/бг_ВидыМаршрутныхЛистов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_ВидыМаршрутныхЛистов</name>
  <enumValues>
    <name>МаршрутныйЛист</name>
  </enumValues>
  <enumValues>
    <name>Рейс</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Documents/битМаршрутныйЛист/битМаршрутныйЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>битМаршрутныйЛист</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.бг_ПредполагаемоеРаспределениеЗатрат</registerRecords>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.бг_ВидыМаршрутныхЛистов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеревозки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПРР</name>
    <type>
      <types>EnumRef.бг_ВидыПРР</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрибытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрибытияФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорНаВладение</name>
    <type>
      <types>CatalogRef.бг_ДоговорыВладенияТС</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорНаВладениеПрицеп</name>
    <type>
      <types>CatalogRef.бг_ДоговорыВладенияТС</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорНаПеревозку</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорСубподряда</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.битМаршрутныйЛист</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагрузкаДатаУбытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаОтправлена</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассГрузоподъемности</name>
    <type>
      <types>CatalogRef.бг_КлассыГрузоподъемностиТС</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПаллет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПаллетСдано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаУПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйКодСтрокиЗаказы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МыГрузимТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВорот</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКонтейнера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузкаИзERP</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеревозчикПартнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановыйПробегПоРейсу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПроведениеСРазличающейсяТранспортнойИнформацией</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировкаТранспортныхРасходов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьТоварыНаСкладеКонсолидировано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПРР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтраховаяСтавка</name>
    <type>
      <types>CatalogRef.бг_СтавкиСтраховыхКомпаний</types>
    </type>
  </attributes>
  <attributes>
    <name>Субподрядчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СубподрядчикПартнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипВладенияТС</name>
    <type>
      <types>CatalogRef.бг_ТипыВладенияТС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКузова</name>
    <type>
      <types>CatalogRef.бг_ТипыКузова</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРейса</name>
    <type>
      <types>EnumRef.бг_ТипыРейсов</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловныйМаршрутныйЛист</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НомераПломб</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортныеРасходыВозмещаются</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутУказанВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусРейса</name>
    <type>
      <types>EnumRef.бг_СтатусыРейсов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаказКлиента</types>
        <types>DocumentRef.ЗаказНаПеремещение</types>
        <types>DocumentRef.ЗаказПоставщику</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОтгрузки</name>
      <type>
        <types>DocumentRef.ПеремещениеТоваров</types>
        <types>DocumentRef.ВозвратТоваровПоставщику</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ВозвратТоваровОтКлиента</types>
        <types>DocumentRef.ПередачаТоваровХранителю</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктНазначения</name>
      <type>
        <types>CatalogRef.битПунктыНазначения</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПростойОтдел</name>
      <type>
        <types>CatalogRef.бг_Департаменты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПростойПояснение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВозвратОтдел</name>
      <type>
        <types>CatalogRef.бг_Департаменты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВозвратПояснение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтраховаяПремия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыгрузкиПрибытие</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыгрузкиУбытие</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расходы</name>
    <attributes>
      <name>ВидТранспортныхРасходов</name>
      <type>
        <types>EnumRef.бг_ВидыТранспортныхРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/Documents/ПриобретениеУслугПрочихАктивов/ПриобретениеУслугПрочихАктивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПриобретениеУслугПрочихАктивов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>бг_Авизо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ПартнерПеревыставление</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗакупкаПодДеятельность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

ERP.belugaerp/src/Catalogs/бг_СтавкиСтраховыхКомпаний/бг_СтавкиСтраховыхКомпаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>бг_СтавкиСтраховыхКомпаний</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ERP.belugaerp/src/DataProcessors/бг_СчетБордеро/ObjectModule.bsl
#Область ПрограммныйИнтерфейс
// Формирует табличный документ отчета
Функция ЕженедельныйБордеро(ПараметрыБордеро) Экспорт  
	УстановитьПривилегированныйРежим(Истина);
    Результат = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("ЕженедельныйБордеро");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Область1");
	ОбластьЗаголовок.Параметры.ДатаНачала = Формат(ПараметрыБордеро.ДатаНачала, "ДЛФ=DD");
	ОбластьЗаголовок.Параметры.ДатаОкончания = Формат(ПараметрыБордеро.ДатаОкончания, "ДЛФ=DD");
	ОбластьЗаголовок.Параметры.ДатаБордеро = Формат(ТекущаяДатаСеанса(), "ДЛФ=DD");
	ОбластьШапка = Макет.ПолучитьОбласть("Область2");
	ОбластьСтрока = Макет.ПолучитьОбласть("Область3");
	ОбластьИтоги = Макет.ПолучитьОбласть("Область4");
	ОбластьПодвал = Макет.ПолучитьОбласть("Область5");
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ДатаНачала", ПараметрыБордеро.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ПараметрыБордеро.ДатаОкончания);
	Запрос.УстановитьПараметр("ТипРейса", ПараметрыБордеро.ТипРейса);
	Запрос.УстановитьПараметр("ИспользоватьФильтрПоТипуРейса", ЗначениеЗаполнено(ПараметрыБордеро.ТипРейса));
	Запрос.УстановитьПараметр("ТипДоставки", ПараметрыБордеро.ТипДоставки);
	Запрос.УстановитьПараметр("Организация", ПараметрыБордеро.Организация);
	Запрос.УстановитьПараметр("ИспользоватьФильтрПоОрганизации", ЗначениеЗаполнено(ПараметрыБордеро.Организация));
	Запрос.УстановитьПараметр("Склад", ПараметрыБордеро.Склад);
	Запрос.УстановитьПараметр("ИспользоватьФильтрПоСкладу", ЗначениеЗаполнено(ПараметрыБордеро.Склад));
	Запрос.Текст = ТекстЗапросаЕженедельныйБордеро();
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаКонтрагент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Первый = Истина;
	Пока ВыборкаКонтрагент.Следующий() Цикл
		ВыборкаДоговор = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДоговор.Следующий() Цикл
			ВыборкаОрганизация = ВыборкаДоговор.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаОрганизация.Следующий() Цикл
				Если Первый Тогда
					Первый = Ложь;
				Иначе 
					Результат.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
				ОбластьЗаголовок.Параметры.Страхователь = ВыборкаОрганизация.Страхователь;
				ОбластьЗаголовок.Параметры.Страховщик = ВыборкаОрганизация.Страховщик;
				ОбластьЗаголовок.Параметры.Договор = ВыборкаОрганизация.ДоговорСтрахования;
				СуммаПрописьюШаблон = НСтр("ru='не более %1 (%2, %3/100) рублей'");
				СуммаСтрока = СокрЛП(ЧислоПрописью(ВыборкаДоговор.МаксимальнаяСтраховаяСумма));
				СуммаПрописью = СтрШаблон(СуммаПрописьюШаблон, 
									Формат(ВыборкаДоговор.МаксимальнаяСтраховаяСумма, "ЧДЦ=2"),
					                Лев(СуммаСтрока, СтрДлина(СуммаСтрока) - СтрДлина(" 00")),                        
									Прав(СуммаСтрока, СтрДлина("00")));
				ОбластьЗаголовок.Параметры.МаксимальнаяСтраховаяСумма = СуммаПрописью;
				Результат.Вывести(ОбластьЗаголовок);
				Результат.Вывести(ОбластьШапка);  
				НомерПП = 0;
				СтраховаяСуммаИтого = 0;
				СтраховаяПремияИтого = 0;
				ВыборкаДаты = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаДаты.Следующий() Цикл 
					ВыборкаРейс = ВыборкаДаты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаРейс.Следующий() Цикл
						ВыборкаТипТранспорта = ВыборкаРейс.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						СтраховаяСуммаДата = 0;
						СтраховаяПремияДата = 0;
						Пока ВыборкаТипТранспорта.Следующий() Цикл
							ВыборкаСтраховаяСтавка = ВыборкаТипТранспорта.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							Пока ВыборкаСтраховаяСтавка.Следующий() Цикл
								ВыборкаПоПунктамПогрузки = ВыборкаСтраховаяСтавка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								Пока ВыборкаПоПунктамПогрузки.Следующий() Цикл
									ВыборкаПоПункамВыгрузки = ВыборкаПоПунктамПогрузки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
									Пока ВыборкаПоПункамВыгрузки.Следующий() Цикл  
										МассивНомеровТТН = Новый Массив;
										ВыборкаПоНомерамТТН = ВыборкаПоПункамВыгрузки.Выбрать();
										Пока ВыборкаПоНомерамТТН.Следующий() Цикл
											МассивНомеровТТН.Добавить(ВыборкаПоНомерамТТН.НомерТТН);
										КонецЦикла;    
										Если СуммаСоответствуетДиапазону(ВыборкаПоПункамВыгрузки.СтраховаяСумма, 
											ПараметрыБордеро.СтраховаяСуммаМинимум, ПараметрыБордеро.СтраховаяСуммаМаксимум) Тогда
											НомерПП = НомерПП + 1;
											НомерТТН = СтрСоединить(МассивНомеровТТН, " ,");
											ОбластьСтрока.Параметры.НомерПП = НомерПП;
											ОбластьСтрока.Параметры.НомерТТН = НомерТТН;
											ОбластьСтрока.Параметры.ДатаТТН = ВыборкаДаты.ДатаТТН;
											ОбластьСтрока.Параметры.Страхователь = ВыборкаПоПункамВыгрузки.Страхователь;
											ОбластьСтрока.Параметры.ТипТранспорта = ВыборкаТипТранспорта.ТипТранспорта;
											ОбластьСтрока.Параметры.ПунктОтправления = ВыборкаПоПунктамПогрузки.ПунктОтправления;
											ОбластьСтрока.Параметры.ПунктНазначения = ВыборкаПоПункамВыгрузки.ПунктНазначения;
											ОбластьСтрока.Параметры.СтраховаяСтавка = ВыборкаСтраховаяСтавка.СтраховаяСтавка;
											ОбластьСтрока.Параметры.СтраховаяСумма = ВыборкаПоПункамВыгрузки.СтраховаяСумма;
											ОбластьСтрока.Параметры.СтраховаяПремия = ВыборкаПоПункамВыгрузки.СтраховаяПремия;
											Результат.Вывести(ОбластьСтрока);
											СтраховаяСуммаДата = СтраховаяСуммаДата + ВыборкаПоПункамВыгрузки.СтраховаяСумма;
											СтраховаяПремияДата = СтраховаяПремияДата + ВыборкаПоПункамВыгрузки.СтраховаяПремия;
											СтраховаяСуммаИтого = СтраховаяСуммаИтого + ВыборкаПоПункамВыгрузки.СтраховаяСумма;
											СтраховаяПремияИтого = СтраховаяПремияИтого + ВыборкаПоПункамВыгрузки.СтраховаяПремия;
										КонецЕсли;
									КонецЦикла;                                         
								КонецЦикла;
							КонецЦикла;
						КонецЦикла;
					КонецЦикла;                                                  
				КонецЦикла;
				ОбластьИтоги.Параметры.СтраховаяСумма = СтраховаяСуммаИтого;
				ОбластьИтоги.Параметры.СтраховаяПремия = СтраховаяПремияИтого;
				Результат.Вывести(ОбластьИтоги);
				Результат.Вывести(ОбластьПодвал);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	Возврат Результат;
КонецФункции

// Формирует табличный документ отчета
Функция СчетБордеро(ПараметрыБордеро) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Результат = Новый ТабличныйДокумент;
	Если ЕстьПоступления(ПараметрыБордеро) Тогда
		Возврат Результат;
	КонецЕсли;    

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаСчетБордео(); 

	Запрос.УстановитьПараметр("ДатаНачала", ПараметрыБордеро.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ПараметрыБордеро.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", ПараметрыБордеро.Организация);
	Запрос.УстановитьПараметр("Договор", ПараметрыБордеро.Договор);
	
	РезультатЗапросаПакет = Запрос.ВыполнитьПакет();
	ДанныеБордео = РезультатЗапросаПакет[0].Выгрузить();
	ДанныеВзаиморасчетов = РезультатЗапросаПакет[1].Выгрузить();
	Макет = ПолучитьМакет("СчетБордеро");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Область1");
	ОбластьШапка = Макет.ПолучитьОбласть("Область2");
	ОбластьСтрока = Макет.ПолучитьОбласть("Область3");
	ОбластьИтоги = Макет.ПолучитьОбласть("Область4");
	ОбластьПодвал = Макет.ПолучитьОбласть("Область5");

	ОбластьЗаголовок.Параметры.ДатаНачала = Формат(ПараметрыБордеро.ДатаНачала, "ДЛФ=DD");
	ОбластьЗаголовок.Параметры.ДатаОкончания = Формат(ПараметрыБордеро.ДатаОкончания, "ДЛФ=DD");
	ОбластьЗаголовок.Параметры.Договор = ПараметрыБордеро.Договор;
	ОбластьЗаголовок.Параметры.Страхователь = ПараметрыБордеро.Организация;
	ОбластьЗаголовок.Параметры.Страховщик = ПараметрыБордеро.Контрагент;
    Результат.Вывести(ОбластьЗаголовок);
    Результат.Вывести(ОбластьШапка);
	
	НомерПП = 0;
	Для каждого СтрокаБордеро Из ДанныеБордео Цикл
		НомерПП = НомерПП + 1;
		ОбластьСтрока.Параметры.Заполнить(СтрокаБордеро);
		ОбластьСтрока.Параметры.НПП = НомерПП;
    	Результат.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	ОбластьИтоги.Параметры.СтраховаяСумма = ДанныеБордео.Итог("СтраховаяСумма");
	ОбластьИтоги.Параметры.СтраховаяПремия = ДанныеБордео.Итог("СтраховаяПремия");
   	Результат.Вывести(ОбластьИтоги);
	
	ОбластьПодвал.Параметры.Заполнить(ПараметрыБордеро);
	ОбластьПодвал.Параметры.СуммаУплачено = ДанныеВзаиморасчетов.Итог("СуммаУплачено");
	ОбластьПодвал.Параметры.СальдоНачальное = ДанныеВзаиморасчетов.Итог("СальдоНачальное");
	ОбластьПодвал.Параметры.СальдоКонечное = ДанныеВзаиморасчетов.Итог("СальдоКонечное");
	ОбластьПодвал.Параметры.СтраховаяПремия = ДанныеБордео.Итог("СтраховаяПремия");
	Результат.Вывести(ОбластьПодвал);
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции                         

Функция СуммаСоответствуетДиапазону(Сумма, СуммаМинимум, СуммаМаксимум)
	Результат = Ложь;
	Если (Сумма >= СуммаМинимум Или СуммаМинимум = 0)
		И (Сумма <= СуммаМаксимум Или СуммаМаксимум = 0) Тогда
		Результат = Истина;
	КонецЕсли;      
	Возврат Результат;
КонецФункции

Функция ТекстЗапросаСчетБордео()
	Возврат
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(битМаршрутныйЛистЗаказы.Ссылка.Дата, НЕДЕЛЯ) КАК НачалоПериода,
	|	КОНЕЦПЕРИОДА(битМаршрутныйЛистЗаказы.Ссылка.Дата, НЕДЕЛЯ) КАК КонецПериода,
	|	СУММА(битМаршрутныйЛистЗаказы.СуммаДокумента) КАК СтраховаяСумма,
	|	СУММА(битМаршрутныйЛистЗаказы.СтраховаяПремия) КАК СтраховаяПремия
	|ИЗ
	|	Документ.битМаршрутныйЛист.Заказы КАК битМаршрутныйЛистЗаказы
	|ГДЕ
	|	битМаршрутныйЛистЗаказы.Ссылка.Проведен
	|	И битМаршрутныйЛистЗаказы.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И битМаршрутныйЛистЗаказы.Ссылка.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.бг_ВидыМаршрутныхЛистов.Рейс)
	|	И битМаршрутныйЛистЗаказы.ДокументОтгрузки.Организация = &Организация
	|	И битМаршрутныйЛистЗаказы.Ссылка.СтраховаяСтавка.Договор = &Договор
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(битМаршрутныйЛистЗаказы.Ссылка.Дата, НЕДЕЛЯ),
	|	КОНЕЦПЕРИОДА(битМаршрутныйЛистЗаказы.Ссылка.Дата, НЕДЕЛЯ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НачалоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(РасчетыСПоставщикамиОстаткиИОбороты.СуммаПриход, 0) КАК СуммаУплачено,
	|	ЕСТЬNULL(РасчетыСПоставщикамиОстаткиИОбороты.СуммаНачальныйОстаток, 0) КАК СальдоНачальное,
	|	ЕСТЬNULL(РасчетыСПоставщикамиОстаткиИОбороты.СуммаКонечныйОстаток, 0) КАК СальдоКонечное
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками.ОстаткиИОбороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			,
	|			,
	|			АналитикаУчетаПоПартнерам.Договор = &Договор
	|				И АналитикаУчетаПоПартнерам.Организация = &Организация) КАК РасчетыСПоставщикамиОстаткиИОбороты";
КонецФункции

Функция ТекстЗапросаЕженедельныйБордеро() 
	Возврат 
	"ВЫБРАТЬ
	|	ТТНВходящаяЕГАИС.Ссылка КАК Ссылка,
	|	ТТНВходящаяЕГАИС.Дата КАК Дата,
	|	ТТНВходящаяЕГАИС.ТипТранспорта КАК ТипТранспорта,
	|	ТТНВходящаяЕГАИС.ПунктПогрузки КАК ПунктПогрузки,
	|	ТТНВходящаяЕГАИС.ПунктРазгрузки КАК ПунктРазгрузки,
	|	ТТНВходящаяЕГАИС.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ втТТНВходящаяЕГАИС
	|ИЗ
	|	Документ.ТТНВходящаяЕГАИС КАК ТТНВходящаяЕГАИС
	|ГДЕ
	|	ТТНВходящаяЕГАИС.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТТНИсходящаяЕГАИС.Ссылка КАК Ссылка,
	|	ТТНИсходящаяЕГАИС.Дата КАК Дата,
	|	ТТНИсходящаяЕГАИС.ТипТранспорта КАК ТипТранспорта,
	|	ТТНИсходящаяЕГАИС.ПунктПогрузки КАК ПунктПогрузки,
	|	ТТНИсходящаяЕГАИС.ПунктРазгрузки КАК ПунктРазгрузки,
	|	ТТНИсходящаяЕГАИС.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ втТТНИсходящаяЕГАИС
	|ИЗ
	|	Документ.ТТНИсходящаяЕГАИС КАК ТТНИсходящаяЕГАИС
	|ГДЕ
	|	ТТНИсходящаяЕГАИС.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	битМаршрутныйЛистЗаказы.Ссылка КАК Ссылка,
	|	битМаршрутныйЛистЗаказы.ДокументОтгрузки.Номер КАК НомерТТН,
	|	НАЧАЛОПЕРИОДА(втТТНИсходящаяЕГАИС.Дата, ДЕНЬ) КАК ДатаТТН,
	|	втТТНИсходящаяЕГАИС.ТипТранспорта КАК ТипТранспорта,
	|	втТТНИсходящаяЕГАИС.ПунктПогрузки КАК ПунктПогрузки,
	|	втТТНИсходящаяЕГАИС.ПунктРазгрузки КАК ПунктРазгрузки,
	|	битМаршрутныйЛистЗаказы.ДокументОтгрузки КАК ДокументОтгрузки,
	|	битМаршрутныйЛистЗаказы.СтраховаяПремия КАК СтраховаяПремия,
	|	битМаршрутныйЛистЗаказы.СуммаДокумента КАК СуммаДокумента
	|ПОМЕСТИТЬ втДанныеДокументов
	|ИЗ
	|	Документ.битМаршрутныйЛист.Заказы КАК битМаршрутныйЛистЗаказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТТНИсходящаяЕГАИС КАК втТТНИсходящаяЕГАИС
	|		ПО (втТТНИсходящаяЕГАИС.ДокументОснование = битМаршрутныйЛистЗаказы.ДокументОтгрузки)
	|ГДЕ
	|	битМаршрутныйЛистЗаказы.Ссылка.Проведен
	|	И битМаршрутныйЛистЗаказы.ДокументОтгрузки В
	|			(ВЫБРАТЬ
	|				втТТНИсходящаяЕГАИС.ДокументОснование
	|			ИЗ
	|				втТТНИсходящаяЕГАИС)
	|	И битМаршрутныйЛистЗаказы.Ссылка.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.бг_ВидыМаршрутныхЛистов.Рейс)
	|	И НЕ битМаршрутныйЛистЗаказы.Ссылка.СтраховаяСтавка = ЗНАЧЕНИЕ(Справочник.бг_СтавкиСтраховыхКомпаний.ПустаяСсылка)
	|	И ВЫБОР
	|			КОГДА &ТипДоставки = ""Самовывоз""
	|				ТОГДА битМаршрутныйЛистЗаказы.Ссылка.ВидПеревозки ПОДОБНО ""%Самовывоз%""
	|			КОГДА &ТипДоставки = ""НеСамовывоз""
	|				ТОГДА НЕ битМаршрутныйЛистЗаказы.Ссылка.ВидПеревозки ПОДОБНО ""%Самовывоз%""
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ИспользоватьФильтрПоТипуРейса
	|				ТОГДА битМаршрутныйЛистЗаказы.Ссылка.ТипРейса = &ТипРейса
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ИспользоватьФильтрПоСкладу
	|				ТОГДА битМаршрутныйЛистЗаказы.Ссылка.Склад В ИЕРАРХИИ (&Склад)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ИспользоватьФильтрПоОрганизации
	|				ТОГДА битМаршрутныйЛистЗаказы.Ссылка.Организация = &Организация
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	битМаршрутныйЛистЗаказы.Ссылка,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(битМаршрутныйЛистЗаказы.ДокументОтгрузки) В (ТИП(Документ.ПриобретениеТоваровУслуг), ТИП(Документ.ВозвратТоваровОтКлиента))
	|			ТОГДА ВЫБОР
	|					КОГДА битМаршрутныйЛистЗаказы.ДокументОтгрузки.НомерВходящегоДокумента = """"""""
	|						ТОГДА битМаршрутныйЛистЗаказы.ДокументОтгрузки.Номер
	|					ИНАЧЕ битМаршрутныйЛистЗаказы.ДокументОтгрузки.НомерВходящегоДокумента
	|				КОНЕЦ
	|		ИНАЧЕ битМаршрутныйЛистЗаказы.ДокументОтгрузки.Номер
	|	КОНЕЦ,
	|	НАЧАЛОПЕРИОДА(втТТНВходящаяЕГАИС.Дата, ДЕНЬ),
	|	втТТНВходящаяЕГАИС.ТипТранспорта,
	|	втТТНВходящаяЕГАИС.ПунктПогрузки,
	|	втТТНВходящаяЕГАИС.ПунктРазгрузки,
	|	битМаршрутныйЛистЗаказы.ДокументОтгрузки,
	|	битМаршрутныйЛистЗаказы.СтраховаяПремия,
	|	битМаршрутныйЛистЗаказы.СуммаДокумента
	|ИЗ
	|	Документ.битМаршрутныйЛист.Заказы КАК битМаршрутныйЛистЗаказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТТНВходящаяЕГАИС КАК втТТНВходящаяЕГАИС
	|		ПО (втТТНВходящаяЕГАИС.ДокументОснование = битМаршрутныйЛистЗаказы.ДокументОтгрузки)
	|ГДЕ
	|	битМаршрутныйЛистЗаказы.Ссылка.Проведен
	|	И битМаршрутныйЛистЗаказы.ДокументОтгрузки В
	|			(ВЫБРАТЬ
	|				втТТНВходящаяЕГАИС.ДокументОснование
	|			ИЗ
	|				втТТНВходящаяЕГАИС)
	|	И битМаршрутныйЛистЗаказы.Ссылка.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.бг_ВидыМаршрутныхЛистов.Рейс)
	|	И битМаршрутныйЛистЗаказы.Ссылка.ТипРейса = &ТипРейса
	|	И НЕ битМаршрутныйЛистЗаказы.Ссылка.СтраховаяСтавка = ЗНАЧЕНИЕ(Справочник.бг_СтавкиСтраховыхКомпаний.ПустаяСсылка)
	|	И ВЫБОР
	|			КОГДА &ТипДоставки = ""Самовывоз""
	|				ТОГДА битМаршрутныйЛистЗаказы.Ссылка.ВидПеревозки ПОДОБНО ""%Самовывоз%""
	|			КОГДА &ТипДоставки = ""НеСамовывоз""
	|				ТОГДА битМаршрутныйЛистЗаказы.Ссылка.ВидПеревозки ПОДОБНО ""%Самовывоз%""
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ИспользоватьФильтрПоСкладу
	|				ТОГДА битМаршрутныйЛистЗаказы.Ссылка.Склад В ИЕРАРХИИ (&Склад)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ИспользоватьФильтрПоОрганизации
	|				ТОГДА битМаршрутныйЛистЗаказы.Ссылка.Организация = &Организация
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(втДанныеДокументов.Ссылка.Организация.НаименованиеПолное КАК СТРОКА(512)) КАК Страхователь,
	|	втДанныеДокументов.Ссылка КАК Рейс,
	|	втДанныеДокументов.Ссылка.СтраховаяСтавка.Контрагент.НаименованиеПолное КАК Страховщик,
	|	втДанныеДокументов.Ссылка.СтраховаяСтавка.Договор КАК ДоговорСтрахования,
	|	втДанныеДокументов.Ссылка.СтраховаяСтавка.Договор.бг_МаксимальнаяСтраховаяСумма КАК МаксимальнаяСтраховаяСумма,
	|	втДанныеДокументов.ТипТранспорта КАК ТипТранспорта,
	|	ВЫРАЗИТЬ(втДанныеДокументов.ПунктПогрузки КАК СТРОКА(512)) КАК ПунктОтправления,
	|	ВЫРАЗИТЬ(втДанныеДокументов.ПунктРазгрузки КАК СТРОКА(512)) КАК ПунктНазначения,
	|	втДанныеДокументов.НомерТТН КАК НомерТТН,
	|	втДанныеДокументов.ДатаТТН КАК ДатаТТН,
	|	втДанныеДокументов.СуммаДокумента КАК СтраховаяСумма,
	|	втДанныеДокументов.СтраховаяПремия КАК СтраховаяПремия,
	|	ВЫБОР
	|		КОГДА втДанныеДокументов.Ссылка.СтраховаяСтавка.Ставка = 0
	|			ТОГДА втДанныеДокументов.Ссылка.СтраховаяСтавка
	|		ИНАЧЕ втДанныеДокументов.Ссылка.СтраховаяСтавка.Ставка
	|	КОНЕЦ КАК СтраховаяСтавка
	|ИЗ
	|	втДанныеДокументов КАК втДанныеДокументов
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаТТН
	|ИТОГИ
	|	МАКСИМУМ(МаксимальнаяСтраховаяСумма),
	|	СУММА(СтраховаяСумма),
	|	СУММА(СтраховаяПремия)
	|ПО
	|	Страховщик,
	|	ДоговорСтрахования,
	|	Страхователь,
	|	ДатаТТН,
	|	Рейс,
	|	ТипТранспорта,
	|	СтраховаяСтавка,
	|	ПунктОтправления,
	|	ПунктНазначения";
КонецФункции

Функция ЕстьПоступления(ПараметрыБордеро)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", ПараметрыБордеро.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ПараметрыБордеро.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", ПараметрыБордеро.Организация);
	Запрос.УстановитьПараметр("Договор", ПараметрыБордеро.Договор);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриобретениеТоваровУслуг.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	|ГДЕ
	|	ПриобретениеТоваровУслуг.Проведен
	|	И ПриобретениеТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ПриобретениеТоваровУслуг.Организация = &Организация
	|	И ПриобретениеТоваровУслуг.Договор = &Договор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриобретениеУслугПрочихАктивов.Ссылка
	|ИЗ
	|	Документ.ПриобретениеУслугПрочихАктивов КАК ПриобретениеУслугПрочихАктивов
	|ГДЕ
	|	ПриобретениеУслугПрочихАктивов.Проведен
	|	И ПриобретениеУслугПрочихАктивов.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ПриобретениеУслугПрочихАктивов.Организация = &Организация
	|	И ПриобретениеУслугПрочихАктивов.Договор = &Договор";
	
	Результат = Запрос.Выполнить();
	
	ЕстьПоступления = Не Результат.Пустой();
	ТекстСообщения = НСтр("ru='В указанном периоде обнаружены проведенные поступления по договору %1:'");
	ТекстСообщения = СтрШаблон(ТекстСообщения, ПараметрыБордеро.Договор); 
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекстСообщения = ТекстСообщения + Символы.ПС + Строка(Выборка.Ссылка);
	КонецЦикла;
	
	Если ЕстьПоступления Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Возврат ЕстьПоступления;
	
КонецФункции

#КонецОбласти
